#include "Header.h"

newdata(struct  stab* head, int n) {
    struct  stab* current = NULL, * prev = NULL; // указатель на текущий и предыдущий элемент списка
    struct  stab* new = (struct  stab*)malloc(sizeof(struct  stab)); // выделение памяти под новый элемент списка
    int counter = 0;

    current = head; // начинаем обход списка с его головы

    // проверяем, что список не пустой
    if (current == NULL) {
        printf("Данные не введены\n");
        exit; // завершаем выполнение программы с кодом ошибки
    }
    else {
        // обходим список до нужной позиции
        while (counter < (n - 1)) {
            current = current->next; // переходим к следующему элементу списка
            counter++;
        }

        // вставляем новый элемент в список
        prev = current->next; // запоминаем следующий элемент списка
        current->next = new; // текущий элемент списка теперь указывает на новый элемент
        new->next = prev;   // новый элемент списка указывает на следующий элемент

        // заполняем поля нового элемента списка
        printf("Ввод данных новой записи\n");
        printf("Введите марку %d стабилизатора нпряжения: ", n + 1);
        scanf("%s", new->mark);
        printf("Введите КПД %d стабилизатора напряжения: ", n + 1);
        scanf("%d", &new->KPD);
        printf("Введите внутреннее сопротивление %d стабилизатора напряжения: ", n + 1);
        scanf("%d", &new->Rin);
        printf("Введите коэффициент стабилизации %d стабилизатора напряжения: ", n + 1);
        scanf("%d", &new->Kst);
        printf("Введите коэффициент сглаживания пульсаций %d стабилизатора напряжения: ", n + 1);
        scanf("%d", &new->Ksp);
        printf("Данные введены\n");
        while (getchar() != '\n')
            continue;

    }
}