#include "Header.h"

void newdata(struct  stab* head, int n) {
    struct  stab* current = NULL, * prev = NULL; // указатель на текущий и предыдущий элемент списка
    struct  stab* new = (struct  stab*)malloc(sizeof(struct  stab)); // выделение памяти под новый элемент списка
    int counter = 0, res;

    current = head; // начинаем обход списка с его головы

    // проверяем, что список не пустой
    if (current == NULL) {
        printf("Данные не введены\n");
        exit(1); // завершаем выполнение программы с кодом ошибки
    }
    else {
        // обходим список до нужной позиции
        while (counter < (n-1)) {
            current = current->next; // переходим к следующему элементу списка
			counter++;
        }


        // вставляем новый элемент в список
        prev = current->next; // запоминаем следующий элемент списка
        current->next = new; // текущий элемент списка теперь указывает на новый элемент
        new->next = prev;   // новый элемент списка указывает на следующий элемент

        // заполняем поля нового элемента списка
        printf("Ввод данных новой записи\n");


		printf("Введите марку %d стабилизатора: ", n + 1); // выводим сообщение для ввода марки стабилизатора
		res = scanf("%11s", new->mark); // считываем введенную марку стабилизатора и сохраняем в структуре current
		while (res != 1 || new->mark <= 0) { // проверяем, что введенное значение корректно
			printf("Значение марки введено не верно, повторите ввод: "); // если значение некорректно, выводим сообщение об ошибке
			while (getchar() != '\n')  continue; // очищаем буфер ввода
			res = scanf("%11s", new->mark); // повторно считываем значение марки			
		}
		while (getchar() != '\n')  continue;


		// аналогично для следующих полей структуры current: КПД, внутреннее сопротивление, коэффициент стабилизации, коэффициент сглаживания пульсаций
		printf("Введите КПД %d стабилизатора напряжения: ", n + 1);
		res = scanf("%d", &new->KPD);
		while (res != 1 || new->KPD < 0) {
			printf("Значение КПД введено не верно, повторите ввод: ");
			while (getchar() != '\n')  continue;
			res = scanf("%d", &new->KPD);
		}

		printf("Введите внутреннее сопротивление %d стабилизатора напряжения: ", n + 1);
		res = scanf("%d", &new->Rin);
		while (res != 1 || new->Rin < 0) {
			printf("Значение внутреннего сопротивления введено не верно, повторите ввод: ");
			while (getchar() != '\n')  continue;
			res = scanf("%d", &new->Rin);
		}

		printf("Введите коэффициент стабилизации %d стабилизатора напряжения: ", n + 1);
		res = scanf("%d", &new->Kst);
		while (res != 1 || new->Kst < 0) {
			printf("Значение коэффициента стабилизации введено не верно, повторите ввод: ");
			while (getchar() != '\n')  continue;
			res = scanf("%d", &new->Kst);

		}

		printf("Введите коэффициент сглаживания пульсаций %d стабилизатора напряжения: ", n + 1);
		res = scanf("%d", &new->Ksp);
		while (res != 1 || new->Ksp < 0) {
			printf("Значение коэффициента сглаживания пульсаций введено не верно, повторите ввод: ");
			while (getchar() != '\n')  continue;
			res = scanf("%d", &new->Ksp);
		}
		


		printf("Данные введены\n");
		while (getchar() != '\n')
			continue;

    }
}