#include "Header.h"
void vyvod(struct  stab* head) {
	int i, count = 0;
	struct  stab* current = NULL;
	while (1) {
		// Если список пуст, выводим сообщение о том, что данные не введены
		if (head == NULL)
			printf("Данные не введены!\n");
		// Иначе присваиваем указателю на текущий элемент значение головы списка
		else
			current = head;

		i = 0;

		printf("----------------------------------------------------------------------------------------------------\n| №|    марка     | КПД стаб. напряжен. | внут. сопр. ст. нап. |   коэф. стаб.  | коэф. сг. пульс. |\n----------------------------------------------------------------------------------------------------\n");

		// Пока текущий элемент списка не равен NULL
		while (current != NULL) {
			// Выводим информацию о текущем элементе списка в виде строки таблицы
			printf("|%2.d| %-12s | %-19d | %-20.d | %-14.d | %-16.d |\n----------------------------------------------------------------------------------------------------\n", i + 1, current->mark, current->KPD, current->Rin, current->Kst, current->Ksp);
			// Перемещаем указатель на следующий элемент списка
			current = current->next;

			i++;
		}

		break;
	}

}